In [ ]:
index2=['a','b','c','d']
series2=pd.Series(np.arange(1,5),index=index2)

In [82]:
print(series2)

a    1
b    2
c    3
d    4
dtype: int32

In [84]:
series2.loc['a':'b']

a    1
b    2
dtype: int32

In [85]:
series2.iloc[0:2]

a    1
b    2
dtype: int32

In [86]:
series2.iloc[-1:]

d    4
dtype: int32

In [94]:
series2.loc['d':'a':-1]

d    4
c    3
b    2
a    1
dtype: int32

In [95]:
series2.iloc[-1:-2:-1]

d    4
dtype: int32

Creating a new dataframe using a list of lists
If manually creating a df, the index has to be defined as a separate list if we are creating the index when df is created

In [209]:
data=[['Joe',44,'USA'],['Mary',35,'USA'],['Kirk',45,'COL'],['Jack',55,'UK'],['Arlene',56,'DE']]
columns=['Name','Age','Country']
Insert_Date=['2018-03-02','2015-04-03','2000-01-01','1990-03-01','2014-05-01']

In [214]:
df=pd.DataFrame(data=data,columns=columns,index=Insert_Date)
df

              Name  Age Country
2018-03-02     Joe   44     USA
2015-04-03    Mary   35     USA
2000-01-01    Kirk   45     COL
1990-03-01    Jack   55      UK
2014-05-01  Arlene   56      DE

In [222]:
df2=pd.DataFrame(data=data,columns=columns)
df2

     Name  Age Country
0     Joe   44     USA
1    Mary   35     USA
2    Kirk   45     COL
3    Jack   55      UK
4  Arlene   56      DE

In [241]:
df2.set_index('Name',inplace=True)
df2

KeyError: "None of ['Name'] are in the columns"

Note that when the dataframe with an inplace index is converted to a new dataframe with a new index, the original index is not copied

In [240]:
df3=df2
df3.set_index('Age')
#df3=df2.set_index('Age')
df3

        Age Country
Name
Joe      44     USA
Mary     35     USA
Kirk     45     COL
Jack     55      UK
Arlene   56      DE

The drop parameter of the index creation is used to maintain the column as is ( False) or to drop the column and only have the index( True- which is default). So when a dataframe is copied , the index is not copied

In [232]:
df2=pd.DataFrame(data=data,columns=columns)
df4=df2.set_index(['Name'],drop=False)
df4

          Name  Age Country
Name
Joe        Joe   44     USA
Mary      Mary   35     USA
Kirk      Kirk   45     COL
Jack      Jack   55      UK
Arlene  Arlene   56      DE

In [229]:
df5=df2.set_index(['Name'],drop=True)
df5

        Age Country
Name
Joe      44     USA
Mary     35     USA
Kirk     45     COL
Jack     55      UK
Arlene   56      DE